blog.org
#+TITLE: 不及格大學士後研究
#+SETUPFILE: theme-readtheorg.setup

#+STARTUP: overview

#+OPTIONS: num:nil

你好，這裏是 [[http://hychen.me][Hychen]] 不入流的學習筆記與碎念。

-----

* 垃圾話
** 會議室裡遺失的東西
#+BEGIN_QUOTE
K: 「有同學在會議室裡遺失重要的東西嗎？」
A: 「青春。」
#+END_QUOTE
source: bobchao's facebook.
** 笑即是殘酷 
#+BEGIN_QUOTE
Mikimoto: 根據幸福守恆定律，有生物笑的時候，一定有生物倒楣，所以笑的人都很殘酷。
#+END_QUOTE
** 生存、質疑與事故
#+BEGIN_QUOTE
Mikimoto: 所有的事情都會分成三個階段：「生存、質疑與世故」，例如以吃飯來說，一剛開始，你會告訴自己要吃飯，之後你會問為什麼要吃飯，最後你會問自己還有什麼東西可以吃
#+END_QUOTE
** 四句話總結人的一生
#+BEGIN_QUOTE
喜歡上一個人，喜歡上一個人，喜歡上一個人，喜歡上一個人。
#+END_QUOTE
source: https://t.co/JQBvV4Hb2R
** JavaScript 帶給人類的啟示
javascript 告訴我們一件事，本身優不優秀不重要，重點是生對地方....
** 為什麼幸福的家庭都一個樣? 不幸的家庭都不一樣？
#+BEGIN_QUOTE
幸福的家庭都一個樣，不幸的家庭則家家有本難念的經。為什麼呢？讓工程師來告訴你：幸福的判斷式是 &&，不幸的判斷式是 ||；同時滿足所有條件才能變成幸福家庭，任一條件不滿足都會變成不幸家庭。
#+END_QUOTE
** 空虛與複雜
小孩的精神很豐富，所以他們的玩具很簡單。
大人的玩具很複雜，所以他們的精神很空虛。
** 矛盾何來
矛盾何來，皆因製杖販劍
** 一無所有
#+BEGIN_QUOTE
不要再說你一無所有了，你不是有病嗎？
#+END_QUOTE
** 跟工科大學生談生涯規劃
友人問曰: 「要跟大學生講職場、生涯規劃，大家覺得應該講些什麼」？

有鄉民答曰: 「工程師怎麼娶到好老婆的」

再有鄉民答曰: 「30歲前討到好老婆不能不知道的30件事」

友人妻奇道: 「所以取老婆比較重要？」

另有鄉民回道 :「娶對，就是人生。 娶錯，就是殘生。」
** 公司來了新人，姓蔡
男的叫蔡比巴, 女的叫菜菜子
** Duck Typing
什麼叫做 duck typing, 只要這個女生化妝起來像正妹，修圖後像正妹，整形後像正妹，那她就是個正妹。
** 熱情與初戀
#+BEGIN_QUOTE
Pingooo: 熱情就像初戀，一旦失去了，就很難追回來
#+END_QUOTE
** 阿宅都很忙
#+BEGIN_QUOTE
Jserv: 要說多少次，阿宅們都很忙碌的呀，不會因為居家就會很有空
#+END_QUOTE
** 要改的地方太多
#+BEGIN_QUOTE
Clkao: 要改的地方太多了，就改天
#+END_QUOTE
** 註定失敗
#+BEGIN_QUOTE
「從什麼時候開始決定你的人生注定失敗？」
『呃，當精子的時候？』
#+END_QUOTE
** 那就改天
改天就是永遠沒有那一天
** 大學專題該做什麼
#+BEGIN_QUOTE
Cindy: 專題就做 Lambda 仿生獸吧!
大二生: 這東西能做什麼用。
Cindy: 學生專題就是要做沒用但有梗的東西，要做有用能賺錢的東西，你之後的機會很多。
#+END_QUOTE
* 假裝有哲理的廢文
** 網路人格
語氣、詞彙、以及藏匿在句子中的思想，
在1與0的空間中交織出一個網路人格。

於是我確信我真的從一篇篇的文章，
漸漸描繪出一個概略的輪廓，認識了妳。

只是妳永遠是那樣的模糊不清析，

妳終究只是個ID。

而我也靠著一次又一次的貼文，
雕塑出一個網路人格，讓別人認識部份的我，

這也終究只是個ID。

或許有天醒來，突然拋開上頭承載的人格、信譽、
人際關係，從新註冊一個ID，從新開使。

那，這算不算一個生命的死亡？

是不是一個ID誕生的太容易，所以學會了說話不負責，
久而久之也將這個惡習，從虛擬中帶進現實。

我們處於一個尷尬的年代，徘徊在虛擬與真實之間。
** 角色扮演
我們都是被一個更大的群體包圍者。
不管你愛或不愛，在恰如其分的年紀，你終究得扮演著別人希望你恰如其分扮演的角色。
* 資訊工程
** Assignment V.S. Binding

所謂的 Functional Language 的變數不可改其實是不精確的。實際上它只是將變數分的更嚴謹，可修改，與不可修改。
先來說說什麼是 Binding. Binding 指的是將一個符號綁定在一個值，綁定後就不可修改，這個符號稱之為變數。以自然語言來理解的話，其實就是代名詞。

#+BEGIN_QUOTE
favonia: 一個變數沒有指到一個值。一個變數可以被一個值取代，但不會儲存什麼內容在裡面。
#+END_QUOTE

所以說下面這個例子， 必須理解為3.14的另一個稱呼叫做 PI, 而不是 PI 這個容器的值是 3.14。而  1 + PI 這個式子的另一個稱呼是 result, 而不是 1 + PI 運算後，將值放到 result 這個容器裡。 不管是PI，還是 result 都只是個代稱，而不是容器。

#+BEGIN_SRC javascript
PI = 3.14
result = 1.0 + PI
#+END_SRC

接下來搭配 SML 來解釋什麼是 Assignment。
下面這段 code 是說 PI 是 3.14的binding, result 是 1 + PI 的binding。
程式執行時(runtime) 會把 PI 這個變數代換成3.14。

#+BEGIN_SRC javascript
val PI = 3.14
val result = 1.0 + PI
#+END_SRC 

那如果需要可修改的變數怎麼辦，SML 可以讓變數綁在值的的指標上, ref 3.14
指的是 3.14 這個值得指標指標。而因為指標指定的值是可以變的，所以現在
PI 可以當成是可以修改的。 PI := 4 只是讓 PI 的值(也就是指標) 從 3.14
指到 4，並不會產生新的binding。

#+BEGIN_SRC javascript
val PI = ref 3.14 # binding
val result = 1.0 + PI # binding
val PI := 4 # assign
#+END_SRC

因此，在所有的 imperative language 裡，不管是Python, Ruby, C, Java, 
變數其實都是被綁在指標上，這樣變數指到的值才能被修改。

所以說，變數只是個值的代稱，如果值是指標，那麼就可以修改指標要指到哪個
值，反之則不行。
但不管怎麼說，變數都不應該被當成是一個容器。

** Study Of Coordination Language And Models
*** Patterns
- [[http://workflowpatterns.com][Workflow Patterns]]
- [[http://communicationtheory.org/patterns-of-communication/][Communication Patters]]
- Dsitrubuted Computing Software Architecture Pattern
  - [[http://www.cs.wustl.edu/~schmidt/POSA/POSA4/][Pattern-Oriented Software Architecture: A Pattern Language for Distributed Computing]]
- Enterprise Intergration Patterns
  - [[http://www.enterpriseintegrationpatterns.com/toc.html][Messaging Patterns]]
*** Coordination Language And Models
**** Papers
***** Coordination models and languages, GA Papadopoulos, F Arbab, 1999
