blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-18 Fri 01:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>不及格大學士後研究</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="陳信屹" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">不及格大學士後研究</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline19">垃圾話</a>
<ul>
<li><a href="#orgheadline1">會議室裡遺失的東西</a></li>
<li><a href="#orgheadline2">笑即是殘酷</a></li>
<li><a href="#orgheadline3">生存、質疑與事故</a></li>
<li><a href="#orgheadline4">四句話總結人的一生</a></li>
<li><a href="#orgheadline5">JavaScript 帶給人類的啟示</a></li>
<li><a href="#orgheadline6">為什麼幸福的家庭都一個樣? 不幸的家庭都不一樣？</a></li>
<li><a href="#orgheadline7">空虛與複雜</a></li>
<li><a href="#orgheadline8">矛盾何來</a></li>
<li><a href="#orgheadline9">一無所有</a></li>
<li><a href="#orgheadline10">跟工科大學生談生涯規劃</a></li>
<li><a href="#orgheadline11">公司來了新人，姓蔡</a></li>
<li><a href="#orgheadline12">Duck Typing</a></li>
<li><a href="#orgheadline13">熱情與初戀</a></li>
<li><a href="#orgheadline14">阿宅都很忙</a></li>
<li><a href="#orgheadline15">要改的地方太多</a></li>
<li><a href="#orgheadline16">註定失敗</a></li>
<li><a href="#orgheadline17">那就改天</a></li>
<li><a href="#orgheadline18">大學專題該做什麼</a></li>
</ul>
</li>
<li><a href="#orgheadline22">假裝有哲理的廢文</a>
<ul>
<li><a href="#orgheadline20">網路人格</a></li>
<li><a href="#orgheadline21">角色扮演</a></li>
</ul>
</li>
<li><a href="#orgheadline131">資訊工程</a>
<ul>
<li><a href="#orgheadline23">Assignment V.S. Binding</a></li>
<li><a href="#orgheadline85">Study Of Coordination Language And Models</a>
<ul>
<li><a href="#orgheadline24">Patterns</a></li>
<li><a href="#orgheadline38">Coordination Language And Models</a></li>
<li><a href="#orgheadline42">Web Services Compositions</a></li>
<li><a href="#orgheadline84">Data Flow</a></li>
</ul>
</li>
<li><a href="#orgheadline86">Flow-Based Programming 2ND Edition, J. Paul Morrison</a>
<ul>
<li><a href="#orgheadline87">Terms</a></li>
<li><a href="#orgheadline88">Mentioned People</a></li>
<li><a href="#orgheadline130">Notes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline142">企業管理</a>
<ul>
<li><a href="#orgheadline132">如何建立客服團隊</a>
<ul>
<li><a href="#orgheadline133">常見問題</a></li>
<li><a href="#orgheadline134">達成共同目標5大法則</a></li>
<li><a href="#orgheadline135">CRM觀念與介紹</a></li>
<li><a href="#orgheadline136">會員資料</a></li>
<li><a href="#orgheadline137">CRM可做什麼?</a></li>
<li><a href="#orgheadline138">客服成本與效益評估</a></li>
<li><a href="#orgheadline139">團隊可能的角色</a></li>
<li><a href="#orgheadline140">要不要外包?</a></li>
<li><a href="#orgheadline141">客服能達到的效益</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline147">自由軟體/開放源碼</a>
<ul>
<li><a href="#orgheadline146">如何成為 Debian Deveoper</a>
<ul>
<li><a href="#orgheadline143">10分鐘快速簡介</a></li>
<li><a href="#orgheadline144">上半部</a></li>
<li><a href="#orgheadline145">下半部</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline151">英文</a>
<ul>
<li><a href="#orgheadline148">垃圾話</a></li>
<li><a href="#orgheadline149">討論事情常用句</a></li>
<li><a href="#orgheadline150">筆戰常用句</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
你好，這裏是 <a href="http://hychen.me/">Hychen</a> 不入流的學習筆記與碎念。
</p>

<hr  />

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19">垃圾話</h2>
<div class="outline-text-2" id="text-orgheadline19">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">會議室裡遺失的東西</h3>
<div class="outline-text-3" id="text-orgheadline1">
<blockquote>
<p>
K: 「有同學在會議室裡遺失重要的東西嗎？」
A: 「青春。」
</p>
</blockquote>
<p>
source: bobchao's facebook.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">笑即是殘酷</h3>
<div class="outline-text-3" id="text-orgheadline2">
<blockquote>
<p>
Mikimoto: 根據幸福守恆定律，有生物笑的時候，一定有生物倒楣，所以笑的人都很殘酷。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">生存、質疑與事故</h3>
<div class="outline-text-3" id="text-orgheadline3">
<blockquote>
<p>
Mikimoto: 所有的事情都會分成三個階段：「生存、質疑與世故」，例如以吃飯來說，一剛開始，你會告訴自己要吃飯，之後你會問為什麼要吃飯，最後你會問自己還有什麼東西可以吃
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">四句話總結人的一生</h3>
<div class="outline-text-3" id="text-orgheadline4">
<blockquote>
<p>
喜歡上一個人，喜歡上一個人，喜歡上一個人，喜歡上一個人。
</p>
</blockquote>
<p>
source: <a href="https://t.co/JQBvV4Hb2R">https://t.co/JQBvV4Hb2R</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">JavaScript 帶給人類的啟示</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
javascript 告訴我們一件事，本身優不優秀不重要，重點是生對地方&#x2026;.
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">為什麼幸福的家庭都一個樣? 不幸的家庭都不一樣？</h3>
<div class="outline-text-3" id="text-orgheadline6">
<blockquote>
<p>
幸福的家庭都一個樣，不幸的家庭則家家有本難念的經。為什麼呢？讓工程師來告訴你：幸福的判斷式是 &amp;&amp;，不幸的判斷式是 ||；同時滿足所有條件才能變成幸福家庭，任一條件不滿足都會變成不幸家庭。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">空虛與複雜</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
小孩的精神很豐富，所以他們的玩具很簡單。
大人的玩具很複雜，所以他們的精神很空虛。
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">矛盾何來</h3>
<div class="outline-text-3" id="text-orgheadline8">
<p>
矛盾何來，皆因製杖販劍
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">一無所有</h3>
<div class="outline-text-3" id="text-orgheadline9">
<blockquote>
<p>
不要再說你一無所有了，你不是有病嗎？
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">跟工科大學生談生涯規劃</h3>
<div class="outline-text-3" id="text-orgheadline10">
<p>
友人問曰: 「要跟大學生講職場、生涯規劃，大家覺得應該講些什麼」？
</p>

<p>
有鄉民答曰: 「工程師怎麼娶到好老婆的」
</p>

<p>
再有鄉民答曰: 「30歲前討到好老婆不能不知道的30件事」
</p>

<p>
友人妻奇道: 「所以取老婆比較重要？」
</p>

<p>
另有鄉民回道 :「娶對，就是人生。 娶錯，就是殘生。」
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">公司來了新人，姓蔡</h3>
<div class="outline-text-3" id="text-orgheadline11">
<p>
男的叫蔡比巴, 女的叫菜菜子
</p>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">Duck Typing</h3>
<div class="outline-text-3" id="text-orgheadline12">
<p>
什麼叫做 duck typing, 只要這個女生化妝起來像正妹，修圖後像正妹，整形後像正妹，那她就是個正妹。
</p>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">熱情與初戀</h3>
<div class="outline-text-3" id="text-orgheadline13">
<blockquote>
<p>
Pingooo: 熱情就像初戀，一旦失去了，就很難追回來
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">阿宅都很忙</h3>
<div class="outline-text-3" id="text-orgheadline14">
<blockquote>
<p>
Jserv: 要說多少次，阿宅們都很忙碌的呀，不會因為居家就會很有空
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">要改的地方太多</h3>
<div class="outline-text-3" id="text-orgheadline15">
<blockquote>
<p>
Clkao: 要改的地方太多了，就改天
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">註定失敗</h3>
<div class="outline-text-3" id="text-orgheadline16">
<blockquote>
<p>
「從什麼時候開始決定你的人生注定失敗？」
『呃，當精子的時候？』
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">那就改天</h3>
<div class="outline-text-3" id="text-orgheadline17">
<p>
改天就是永遠沒有那一天
</p>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">大學專題該做什麼</h3>
<div class="outline-text-3" id="text-orgheadline18">
<blockquote>
<p>
Cindy: 專題就做 Lambda 仿生獸吧!
大二生: 這東西能做什麼用。
Cindy: 學生專題就是要做沒用但有梗的東西，要做有用能賺錢的東西，你之後的機會很多。
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22">假裝有哲理的廢文</h2>
<div class="outline-text-2" id="text-orgheadline22">
</div><div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20">網路人格</h3>
<div class="outline-text-3" id="text-orgheadline20">
<p>
語氣、詞彙、以及藏匿在句子中的思想，
在1與0的空間中交織出一個網路人格。
</p>

<p>
於是我確信我真的從一篇篇的文章，
漸漸描繪出一個概略的輪廓，認識了妳。
</p>

<p>
只是妳永遠是那樣的模糊不清析，
</p>

<p>
妳終究只是個ID。
</p>

<p>
而我也靠著一次又一次的貼文，
雕塑出一個網路人格，讓別人認識部份的我，
</p>

<p>
這也終究只是個ID。
</p>

<p>
或許有天醒來，突然拋開上頭承載的人格、信譽、
人際關係，從新註冊一個ID，從新開使。
</p>

<p>
那，這算不算一個生命的死亡？
</p>

<p>
是不是一個ID誕生的太容易，所以學會了說話不負責，
久而久之也將這個惡習，從虛擬中帶進現實。
</p>

<p>
我們處於一個尷尬的年代，徘徊在虛擬與真實之間。
</p>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21">角色扮演</h3>
<div class="outline-text-3" id="text-orgheadline21">
<p>
我們都是被一個更大的群體包圍者。
不管你愛或不愛，在恰如其分的年紀，你終究得扮演著別人希望你恰如其分扮演的角色。
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline131" class="outline-2">
<h2 id="orgheadline131">資訊工程</h2>
<div class="outline-text-2" id="text-orgheadline131">
</div><div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">Assignment V.S. Binding</h3>
<div class="outline-text-3" id="text-orgheadline23">
<p>
所謂的 Functional Language 的變數不可改其實是不精確的。實際上它只是將變數分的更嚴謹，可修改，與不可修改。
先來說說什麼是 Binding. Binding 指的是將一個符號綁定在一個值，綁定後就不可修改，這個符號稱之為變數。以自然語言來理解的話，其實就是代名詞。
</p>

<blockquote>
<p>
favonia: 一個變數沒有指到一個值。一個變數可以被一個值取代，但不會儲存什麼內容在裡面。
</p>
</blockquote>

<p>
所以說下面這個例子， 必須理解為3.14的另一個稱呼叫做 PI, 而不是 PI 這個容器的值是 3.14。而  1 + PI 這個式子的另一個稱呼是 result, 而不是 1 + PI 運算後，將值放到 result 這個容器裡。 不管是PI，還是 result 都只是個代稱，而不是容器。
</p>

<div class="org-src-container">

<pre class="src src-javascript">PI = <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">14</span>
result = <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> + PI
</pre>
</div>

<p>
接下來搭配 SML 來解釋什麼是 Assignment。
下面這段 code 是說 PI 是 3.14的binding, result 是 1 + PI 的binding。
程式執行時(runtime) 會把 PI 這個變數代換成3.14。
</p>

<div class="org-src-container">

<pre class="src src-javascript">val PI = <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">14</span>
val result = <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> + PI
</pre>
</div>

<p>
那如果需要可修改的變數怎麼辦，SML 可以讓變數綁在值的的指標上, ref 3.14
指的是 3.14 這個值得指標指標。而因為指標指定的值是可以變的，所以現在
PI 可以當成是可以修改的。 PI := 4 只是讓 PI 的值(也就是指標) 從 3.14
指到 4，並不會產生新的binding。
</p>

<div class="org-src-container">

<pre class="src src-javascript">val PI = ref <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">14</span> # binding
val result = <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> + PI # binding
val PI := <span style="color: #a45bad;">4</span> # assign
</pre>
</div>

<p>
因此，在所有的 imperative language 裡，不管是Python, Ruby, C, Java, 
變數其實都是被綁在指標上，這樣變數指到的值才能被修改。
</p>

<p>
所以說，變數只是個值的代稱，如果值是指標，那麼就可以修改指標要指到哪個
值，反之則不行。
但不管怎麼說，變數都不應該被當成是一個容器。
</p>
</div>
</div>

<div id="outline-container-orgheadline85" class="outline-3">
<h3 id="orgheadline85">Study Of Coordination Language And Models</h3>
<div class="outline-text-3" id="text-orgheadline85">
</div><div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24">Patterns</h4>
<div class="outline-text-4" id="text-orgheadline24">
<ul class="org-ul">
<li><a href="http://workflowpatterns.com/">Workflow Patterns</a></li>
<li><a href="http://communicationtheory.org/patterns-of-communication/">Communication Patters</a></li>
<li>Dsitrubuted Computing Software Architecture Pattern
<ul class="org-ul">
<li><a href="http://www.cs.wustl.edu/~schmidt/POSA/POSA4/">Pattern-Oriented Software Architecture: A Pattern Language for Distributed Computing</a></li>
</ul></li>
<li>Enterprise Intergration Patterns
<ul class="org-ul">
<li><a href="http://www.enterpriseintegrationpatterns.com/toc.html">Messaging Patterns</a></li>
</ul></li>
</ul>
</div>
</div>
