blog.html
<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38">Coordination Language And Models</h4>
<div class="outline-text-4" id="text-orgheadline38">
</div><ul class="org-ul"><li><a id="orgheadline37"></a>Papers<br  /><ul class="org-ul"><li><a id="orgheadline36"></a>Coordination models and languages, GA Papadopoulos, F Arbab, 1999<br  /><ul class="org-ul"><li><a id="orgheadline25"></a>The concept of coordination is by no means limited to Computer Science.<br  /><div class="outline-text-7" id="text-orgheadline25">
<p>
Malone and Crowston characterise coordination as an emerging research area with an interdisciplinary focus,
playing a key issue in many diverse disciplines such as economics and operational  research,  organisation theory  and  biology.
</p>
</div></li>
<li><a id="orgheadline26"></a>What is Coordination Model<br  /><div class="outline-text-7" id="text-orgheadline26">
<ul class="org-ul">
<li>the glue that binds separate activities into an ensemble.</li>
<li>The need of Multilingual and Heterogeneous Systems</li>
</ul>
</div></li>
<li><a id="orgheadline27"></a>Coordination works well  on distributed/parallel programming.<br  /><div class="outline-text-7" id="text-orgheadline27">
<p>
Programming a distributed or parallel system can be seen as the combination of two distinct activities: the actual
computing part comprising a number of processes involved in manipulating data and a coordination part responsible for
the communication and cooperation between the processes. Thus, coordination can be used to distinguish the computational
concerns of some distributed or parallel application from the communication ones, allowing the separate development but also
the eventual amalgamation of the these two major development phases.
</p>
</div></li>
<li><a id="orgheadline28"></a>Data-Driven<br  /><div class="outline-text-7" id="text-orgheadline28">
<ul class="org-ul">
<li>The main characteristic of the data-driven coordination models and languages is the fact that the state of the computation at any moment
in time is defined in terms of both the values of the data being received or sent and the actual configuration of the coordinated components.</li>
<li>A data-driven coordination language typically offers some coordination primitives (coupled with a coordination metaphor) which are mixed within
the purely computational part of  the  code.  These  primitives  do  encapsulate  in  a  useful  way  the  communication  and configurational
aspects of some computation, but must be used in conjunction with the purely computational manipulation of data associated with some process.
This means that processes cannot easily be distinguished as either coordination or computational processes.</li>
</ul>
</div>
<ul class="org-ul"><li><a id="orgheadline29"></a>Data-Driven Model - Shared Data Space<br  /><div class="outline-text-8" id="text-orgheadline29">
<ul class="org-ul">
<li>Almost all coordination models belonging to this category have evolved around the notion of a <b>Shared Dataspace</b>.</li>
<li>A <b>Shared  Dataspace</b> is a common, content-addressable  data structure. All processes involved in some computation can communicate among themselves only indirectly via this medium.
this metaphor achieves decoupling of processes in both space and time.</li>
</ul>
</div></li>
<li><a id="orgheadline30"></a>Data-Driven Model - Message-passing<br  /></li>

<li><a id="orgheadline31"></a>Data-Driven Model - Compositional Programming<br  /><div class="outline-text-8" id="text-orgheadline31">
<ul class="org-ul">
<li>A compositional programming system is one in which properties of program
components are preserved when those components are composed in parallel
with other program components.
Thus, it is possible to define in a compositional way recurring patterns
of parallel computation, whether configuration ones (such as mapping techniques)
or communication ones (such as streamers  and  mergers),  as  building  blocks
and  combine  them  together  to  form  bigger programs.</li>
<li>2 approachs
<ul class="org-ul">
<li><b>concurrent logic programming</b></li>
<li><b>functional programming</b></li>
</ul></li>
</ul>
</div></li></ul></li>
<li><a id="orgheadline32"></a>Control-Driven<br  /><div class="outline-text-7" id="text-orgheadline32">
<ul class="org-ul">
<li>the coordinated framework evolves by means of observing state changes in processes
and, possibly, broadcast of events. Contrary to the case of the data-driven family
where coordinators directly handle and examine data values, here processes
(whether coordination or computational ones) are treated as black boxes; data handled
within a  process is of no concern to the environment of the process.</li>
<li>Processes communicate with their environment by means of clearly defined interfaces,
usually referred to as input or output ports. Producer-consumer relationships are formed
by means of setting up stream or channel connections between output ports of producers
and input ports of consumers. By nature, these connections are point-to-point, although
limited  broadcasting functionality  is  usually  allowed  by  forming  1-n
relationships  between  a  producer  and  n consumers and vice versa.</li>
<li>Most of the coordination languages to be described in this section realise in one way or
another the above <b>CSP</b>- or <b>Occam-like</b> formalism.</li>
<li><b>static reconfiguration</b> v.s. <b>dynamic reconfiguration</b></li>
<li><a href="http://projects.cwi.nl/manifold/">MANIFOLD</a></li>
</ul>
</div></li>
<li><a id="orgheadline33"></a>Comparision Between Data-Driven and Control-Driven<br  /><div class="outline-text-7" id="text-orgheadline33">
<ul class="org-ul">
<li>In the case of the data-driven category, the coordination component is usually a set of primitives with predefined functionality which is used in connection with
some “host” computational language, in the control-driven category the coordination component is usually a fully-fledged language.</li>
<li>The data-driven category tends to be used mostly for parallelising computational problems. The control-driven category tends to be used primarily for modelling systems.</li>
<li>the data- vs. control-driven separation is by no means a clear cut one.</li>
</ul>
</div></li>
<li><a id="orgheadline34"></a>Major Dimensions Of Coordination Model<br  /><div class="outline-text-7" id="text-orgheadline34">
<ul class="org-ul">
<li>the entities being coordinated</li>
<li>the mechanism of coordination</li>
<li>the coordination medium or architecture</li>
<li>the semantics, rules of protocols of coordination employed</li>
<li>whether a model supports a different (from the computational component) coordination language or involves the use of “add-on” primitives</li>
<li>whether a model supports and encourages the use of many computational languages</li>
<li>what is the most relevant application domain for each  model</li>
<li>what is the implementation status of the proposed framework.</li>
</ul>
</div></li>
<li><a id="orgheadline35"></a>Concerned Issues<br  /><div class="outline-text-7" id="text-orgheadline35">
<ul class="org-ul">
<li>flat unstructured communication medium v.s. hierarchical levels of their communication medium</li>
<li>port-to-port connections via streams with static/dymaic reconfiguration support.</li>
<li>channnled-based v.s. medium-based</li>
</ul>
</div></li></ul></li></ul></li></ul>
</div>

<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42">Web Services Compositions</h4>
<div class="outline-text-4" id="text-orgheadline42">
</div><ul class="org-ul"><li><a id="orgheadline41"></a>Papers<br  /><ul class="org-ul"><li><a id="orgheadline39"></a>van der Aalst, W.M.P, Dumas, M. ; ter Hofstede, A.H.M..  (2003). Web Service Composition Languages: Old Wine in New Bottles?. IEEE.<br  /></li>
<li><a id="orgheadline40"></a>Luca Cardelli and Rowan Davies. . (1997). Service Combinators for Web Computing. IEEE.<br  /></li></ul></li></ul>
</div>
<div id="outline-container-orgheadline84" class="outline-4">
<h4 id="orgheadline84">Data Flow</h4>
<div class="outline-text-4" id="text-orgheadline84">
</div><ul class="org-ul"><li><a id="orgheadline46"></a>Books<br  /><ul class="org-ul"><li><a id="orgheadline43"></a>Morrison, J. P. (1994). Flow-based programming. Van Nostrand Reinhold.<br  /></li>
<li><a id="orgheadline44"></a>Van-Roy, P., &amp; Haridi, S. (2004). Concepts, techniques, and models of computer programming. MIT press.<br  /></li>
<li><a id="orgheadline45"></a>Matt Carkci. (2014). Dataflow and Reactive Programming Systems. Leanpub.<br  /></li></ul></li>
<li><a id="orgheadline83"></a>Papers<br  /><ul class="org-ul"><li><a id="orgheadline47"></a>Kelly, J. L., Lochbaum, C., &amp; Vyssotsky, V. A. (1961). A block diagram compiler. Bell System Technical Journal, 40(3), 669-676.<br  /></li>
<li><a id="orgheadline48"></a>Sutherland, W. R. (1966). ON-LINE GRAPHICAL SPECIFICATION OF COMPUTER PROCEDURES (No. TR-405). LINCOLN LAB MASS INST OF TECH LEXINGTON.<br  /></li>
<li><a id="orgheadline49"></a>Rodrigues, J. E., &amp; Rodriguez Bezos, J. E. (1969). A Graph Model for Parallel Computations.<br  /></li>
