blog.html
<li><a id="orgheadline50"></a>Dennis, J. B. (1972). On the design and specification of a common base language (No. MAC-TR-101). MASSACHUSETTS INST OF TECH CAMBRIDGE PROJECT MAC.<br  /></li>
<li><a id="orgheadline51"></a>Dennis, J. B. (1974, January). First version of a data flow procedure language. In Programming Symposium (pp. 362-376). Springer Berlin Heidelberg.<br  /></li>
<li><a id="orgheadline52"></a>Gilles, K. A. H. N. (1974). The semantics of a simple language for parallel programming. In In Information Processing’74: Proceedings of the IFIP Congress (Vol. 74, pp. 471-475).<br  /></li>
<li><a id="orgheadline53"></a>Karp, R. M., &amp; Miller, R. E. (1966). Properties of a model for parallel computations: Determinacy, termination, queueing. SIAM Journal on Applied Mathematics, 14(6), 1390-1411.<br  /></li>
<li><a id="orgheadline54"></a>Karp, R. M., &amp; Miller, R. E. (1966). Properties of a model for parallel computations: Determinacy, termination, queueing. SIAM Journal on Applied Mathematics, 14(6), 1390-1411.<br  /></li>
<li><a id="orgheadline55"></a>Nikhil, R. S. (1989, April). Can dataflow subsume von Neumann computing?. In ACM SIGARCH Computer Architecture News (Vol. 17, No. 3, pp. 262-272). ACM.<br  /></li>
<li><a id="orgheadline56"></a>Karp, R. M., &amp; Miller, R. E. (1966). Properties of a model for parallel computations: Determinacy, termination, queueing. SIAM Journal on Applied Mathematics, 14(6), 1390-1411.<br  /></li>
<li><a id="orgheadline57"></a>Berry, G. (1989). Real time programming: Special purpose or general purpose languages.<br  /></li>
<li><a id="orgheadline58"></a>Lee, E. (1991). Consistency in dataflow graphs. Parallel and Distributed Systems, IEEE Transactions on, 2(2), 223-235.<br  /></li>
<li><a id="orgheadline59"></a>Buck, J., &amp; Lee, E. A. (1992, May). The token flow model. In Data Flow Workshop.<br  /></li>
<li><a id="orgheadline60"></a>Hils, D. D. (1992). Visual languages and computing survey: Data flow visual programming languages. Journal of Visual Languages &amp; Computing, 3(1), 69-101.<br  /></li>
<li><a id="orgheadline61"></a>Hurson, A. R., Hurson, A. R., Lee, B., &amp; Lee, B. (1993). Issues in dataflow computing. Adv. in Comput, 37(285-333), 38-39.<br  /></li>
<li><a id="orgheadline62"></a>Buck, J. T., &amp; Lee, E. A. (1993, April). Scheduling dynamic dataflow graphs with bounded memory using the token flow model. In Acoustics, Speech, and Signal Processing, 1993. ICASSP-93., 1993 IEEE International Conference on (Vol. 1, pp. 429-432). IEEE.<br  /></li>
<li><a id="orgheadline63"></a>Bhattacharyya, S. S., &amp; Lee, E. A. (1994). Looped schedules for dataflow descriptions of multirate signal processing algorithms. Formal Methods in System Design, 5(3), 183-205.<br  /></li>
<li><a id="orgheadline64"></a>Bhattacharyya, S. S., Buck, J. T., Ha, S., &amp; Lee, E. A. (1995). Generating compact code from dataflow specifications of multirate signal processing algorithms. Circuits and Systems I: Fundamental Theory and Applications, IEEE Transactions on, 42(3), 138-150.<br  /></li>
<li><a id="orgheadline65"></a>Parks, T. M. (1995). Bounded scheduling of process networks (Doctoral dissertation, University of California). Chicago<br  /></li>
<li><a id="orgheadline66"></a>Parks, T. M., Pino, J. L., &amp; Lee, E. A. (1995, October). A comparison of synchronous and cycle-static dataflow. In Signals, Systems and Computers, 1995. 1995 Conference Record of the Twenty-Ninth Asilomar Conference on (Vol. 1, pp. 204-210). IEEE.<br  /></li>
<li><a id="orgheadline67"></a>Lee, E. A., &amp; Parks, T. M. (1995). Dataflow process networks. Proceedings of the IEEE, 83(5), 773-801.<br  /></li>
<li><a id="orgheadline68"></a>Verdoscia, L. O. R. E. N. Z. O. (1996). ALFA fine grain dataflow machine. International Programming, ma orgun and ea ashcroft edition.<br  /></li>
<li><a id="orgheadline69"></a>Lee, E. A. (1997). A denotational semantics for dataflow with firing. Electronics Research Laboratory, College of Engineering, University of California.<br  /></li>
<li><a id="orgheadline70"></a>Robic, B., Silc, J., &amp; Ungerer, T. (2000). Beyond dataflow. Journal of Computing and Information Technology, 8(2), 89-102.<br  /></li>
<li><a id="orgheadline71"></a>Lee, B. (2000). Specification and design of reactive systems (Doctoral dissertation, UNIVERSITY of CALIFORNIA).<br  /></li>
<li><a id="orgheadline72"></a>Liu, J., &amp; Lee, E. A. (2002). A component-based approach to modeling and simulating mixed-signal and hybrid systems. ACM Transactions on Modeling and Computer Simulation (TOMACS), 12(4), 343-368.<br  /></li>
<li><a id="orgheadline73"></a>Johnston, W. M., Hanna, J. R., &amp; Millar, R. J. (2004). Advances in dataflow programming languages. ACM Computing Surveys (CSUR), 36(1), 1-34.<br  /></li>
<li><a id="orgheadline74"></a>Petersen, A., Putnam, A., Mercaldi, M., Schwerin, A., Eggers, S., Swanson, S., &amp; Oskin, M. (2006, September). Reducing control overhead in dataflow architectures. In 「Proceedings of the 15th international conference on Parallel architectures and compilation techniques (pp. 182-191). ACM.<br  /></li>
<li><a id="orgheadline75"></a>Lee, E. A. (2009). Computing needs time. Communications of the ACM, 52(5), 70-79.<br  /></li>
<li><a id="orgheadline76"></a>Arandi, S., &amp; Evripidou, P. (2010, July). Programming multi-core architectures using data-flow techniques. In Embedded Computer Systems (SAMOS), 2010 International Conference on (pp. 152-161). IEEE.<br  /></li>
<li><a id="orgheadline77"></a>Lee, E. A., &amp; Varaiya, P. (2011). Structure and interpretation of signals and systems, Second Edition, LeeVaraiya.org.<br  /></li>
<li><a id="orgheadline78"></a>Amsden, E. (2011). A survey of functional reactive programming. Unpublished.<br  /></li>
<li><a id="orgheadline79"></a>Sousa, T. B. (2012). Dataflow Programming Concept, Languages and Applications. In Doctoral Symposium on Informatics Engineering.<br  /></li>
<li><a id="orgheadline80"></a>Odersky, M., &amp; Maier, I. (2012). Deprecating the Observer Pattern with Scala. React (No. EPFL-REPORT-176887).<br  /></li>
<li><a id="orgheadline81"></a>Mishra, V., &amp; Oney, K. Predictive Block Dataflow Model for Parallel Computation.<br  /></li>
<li><a id="orgheadline82"></a>Chakilam, S. R. A. K. C., &amp; O’Neil, T. W. STATIC SCHEDULING FOR CYCLO STATIC DATA FLOW GRAPHS.<br  /></li></ul></li></ul>
</div>
</div>

<div id="outline-container-orgheadline86" class="outline-3">
<h3 id="orgheadline86">Flow-Based Programming 2ND Edition, J. Paul Morrison</h3>
<div class="outline-text-3" id="text-orgheadline86">
</div>
<div id="outline-container-orgheadline87" class="outline-4">
<h4 id="orgheadline87">Terms</h4>
<div class="outline-text-4" id="text-orgheadline87">
<dl class="org-dl">
<dt>Configurable modularity</dt><dd>a term coined by Raoul de Campo of IBM Research and later expanded on by Nate Edwards of the same organization, denoting the ability to reuse independent components by changing their interconnections, but not their internals.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> In Edwards' view this characterizes all successful reuse systems, and indeed all systems which can be described as "engineered".</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline88" class="outline-4">
<h4 id="orgheadline88">Mentioned People</h4>
<div class="outline-text-4" id="text-orgheadline88">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Page</th>
<th scope="col" class="org-left">Purpose</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Wayne Stevens</td>
<td class="org-right">5</td>
<td class="org-left">強調FBP會成為典範轉移的重要因素</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">David Gelernter</td>
<td class="org-right">7</td>
<td class="org-left">指出FBP是 Coordination Language的一種例子</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nicholas Carriero</td>
<td class="org-right">7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Raoul de Campo</td>
<td class="org-right">7</td>
<td class="org-left">介紹Raoul 研究的 "configurable modularity</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nate Edwards</td>
<td class="org-right">7</td>
<td class="org-left">指出Nate Edwards 的 configurable modularity 研究篇硬體所以沒被重視</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Jackson 1975</td>
<td class="org-right">24</td>
<td class="org-left">指出 Design 跟 Impleentartion 在FBP的概念</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<ul class="org-ul"><li><a id="orgheadline89"></a><a href="https://en.wikipedia.org/wiki/Wayne_Stevens">Wayne Stevens</a><br  /><div class="outline-text-5" id="text-orgheadline89">
<ul class="org-ul">
