blog.html
<li>A software engineer, chief architect of application development methodology 
for IBM's consulting group.</li>
<li>Important works are 
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Structured_analysis">Structured Design</a></li>
</ul></li>
</ul>
</div></li>

<li><a id="orgheadline90"></a><a href="https://en.wikipedia.org/wiki/David_Gelernter">David Gelernter</a><br  /><div class="outline-text-5" id="text-orgheadline90">
<ul class="org-ul">
<li>Parallel Computation</li>
</ul>
</div></li>
<li><a id="orgheadline91"></a>Nicholas Carriero<br  /></li></ul>
</div>

<div id="outline-container-orgheadline130" class="outline-4">
<h4 id="orgheadline130">Notes</h4>
<div class="outline-text-4" id="text-orgheadline130">
</div><ul class="org-ul"><li><a id="orgheadline92"></a>Chaoter 0: Prologue<br  /><div class="outline-text-5" id="text-orgheadline92">
<p>
作者自介自己的成長背景，大學在 King's college 就讀人類學系，並且強調將人類行為轉換成符號邏輯是件很困難的事情
在他的IBM生涯中，不斷碰觸到IBM電腦的瓶頸，這使得他開始專注在一個基本問題 - 為什麼在電腦上開發程式這麼困難，當要讓電腦做一些人類覺得很簡單的事情時。
</p>
</div>
<ul class="org-ul"><li><a id="orgheadline93"></a>Reusable Code<br  /><div class="outline-text-6" id="text-orgheadline93">
<p>
作者寫過 Compiler (BABEL), 也寫過 Interpreter (BLIS), 而在那個年代已經有 reusable subroutine library，只是幾乎都是一次性函數, 
像是*binary function*, 他曾試圖撰寫通用的大量更新的*function*, 但卻失敗了(只支援少數的資料集合), 這些經驗讓他開始思考是否有另一種方式
可以產生可再用的程式碼。
</p>
</div></li>
<li><a id="orgheadline94"></a>Rapid Prototyping<br  /><div class="outline-text-6" id="text-orgheadline94">
<p>
作者相信不管做任何事，只要有懷疑的地方，就先做出一個 prototyping, 並認為好的 prototyping 是可以一直成長，直到成為完整的系統。
並提到[David的書:1]也有說到數種結合互動式開發與Milestone的放式。
</p>
</div></li>
<li><a id="orgheadline95"></a>Focus Of This Book<br  /><div class="outline-text-6" id="text-orgheadline95">
<p>
The approach mentioned hre is for bussiness applications, not mathematical applications.
</p>
</div></li>
<li><a id="orgheadline96"></a>Thinking things visual term<br  /><div class="outline-text-6" id="text-orgheadline96">
<p>
由於他媽媽使母親的關係，使他在成長過程中常使用圖像式思考，在這本書提到的很重要的一點是使用圖像是符號來開發程式，有個好處是能利用到人類的圖像思考能力。
間或提到 [GPSS:2]對他的影響，使他在介紹資料處理時是從單一 Record，而非電腦邏輯。(作者沒有電腦科學訓練)
</p>
</div></li>
<li><a id="orgheadline97"></a>Application Design is a creative activity<br  /></li>
<li><a id="orgheadline98"></a>Fun<br  /><div class="outline-text-6" id="text-orgheadline98">
<ul class="org-ul">
<li>The word "amateur" comes from the idea of loving. One should be proud to be called an computing amateur.</li>
<li>If an activity isn't fun, humans probaly shouldn't be doing it.</li>
<li>The guys who turn out the most code are the ones who are having fun! - P.R Ewing.</li>
<li>Play is not something we have to put away when we reach the state of adulthood</li>
</ul>
</div></li></ul></li>
<li><a id="orgheadline99"></a>Chpater 1: Introduction<br  /><div class="outline-text-5" id="text-orgheadline99">
<p>
敘述FBP實作的應用程式很容易被修改以達成目標，並強調這是個存在四十年以上且被驗證的技術。
讓開發者專注在data transformation的方式，而不是procedural code，讓開發者專注在快速開發，產生跟容易維護的系統。
同時，FBP也很適合分散式運算。
作者同時指出，FBP需要數天到數週的學習時間。因為FBP背後隱含的思考模型與傳統程式相當不同。
要把sequencial program改成支援multiplethread很困難，而 Von Neumann Computer Model 是讓程式開發非常困難的原因之一
</p>
</div>
<ul class="org-ul"><li><a id="orgheadline100"></a>FBP != Data Flow<br  /><div class="outline-text-6" id="text-orgheadline100">
<ul class="org-ul">
<li>flow-based programming shares some basic concept with dataflow 
architectures in computer design, but they are still not the same.</li>
<li>作者認為要使用FBP是因為dataflow archtecture 不包含control flow的部分，而FBP包含，
因此要使用另一個名稱以方便區隔。</li>
<li>其他大多數 data flow programming 專注在數學運算，但FBP不僅僅是</li>
<li>作者曾有過的模擬器經驗，讓他意識到若讓物件在這些運算中流動，會有更好的生產力。</li>
</ul>
</div></li>
<li><a id="orgheadline101"></a>Entity flow throw the network<br  /><div class="outline-text-6" id="text-orgheadline101">
<ul class="org-ul">
<li>each entity reoresents an object with attributes.</li>
<li>the term <b>entity</b>, <b>object</b> is too often used in many aspects, to more be 
cliafied, the author defines a new term <b>Information Packets</b>.</li>
</ul>
</div></li>
<li><a id="orgheadline102"></a>打預防針<br  /><div class="outline-text-6" id="text-orgheadline102">
<ul class="org-ul">
<li>避免讀者快速下結論說FBP就只是&#x2026;, 而放棄了閱讀</li>
</ul>
</div></li></ul></li>
<li><a id="orgheadline103"></a>Chapter 2: High-Level Languages, 4GLs and Source Code Reuse<br  /></li>
<li><a id="orgheadline104"></a>Chapter 3: Basic Concepts<br  /></li>
<li><a id="orgheadline105"></a>Chapter 4: Reuse of components<br  /></li>
<li><a id="orgheadline106"></a>Chapter 5: Parametrization of Reusable Components<br  /></li>
<li><a id="orgheadline107"></a>Chapter 6: Composite Components<br  /></li>
<li><a id="orgheadline108"></a>Chapter 7: Building Components &amp; Some More Simple Applications<br  /></li>
<li><a id="orgheadline109"></a>Chapter 8: Substreams and Control IPs<br  /><div class="outline-text-5" id="text-orgheadline109">
<ul class="org-ul">
<li>大約有1/4 商業程式是在做 Update，用非FBP做會非常困難。</li>
</ul>
</div></li>
<li><a id="orgheadline110"></a>Chapter 9: Some more components and Simple Applications<br  /></li>
<li><a id="orgheadline111"></a>Chapter 10: Data Descriptions and Descriptors<br  /></li>
<li><a id="orgheadline112"></a>Chapter 11: Tree Structure<br  /></li>
<li><a id="orgheadline113"></a>Chapter 12: Scheduling Rules<br  /></li>
<li><a id="orgheadline114"></a>Chapter 13: Loop-Type Networks<br  /></li>
<li><a id="orgheadline115"></a>Chapter 14: Implementation, Network Splitting and Client-Server<br  /></li>
<li><a id="orgheadline116"></a>Chapter 15: Deadlocks: Their Causes and Prevention<br  /></li>
<li><a id="orgheadline117"></a>Chapter 16: Problem-Oriented Mini Language<br  /></li>
<li><a id="orgheadline118"></a>Chapter 17: A Bussiness-Oriented Very High Level Language<br  /></li>
<li><a id="orgheadline119"></a>Chapter 18: Synchronization and Checkpoints<br  /></li>
<li><a id="orgheadline120"></a>Chapter 19: General Framwork for Interactive Applications<br  /></li>
<li><a id="orgheadline121"></a>Chapter 20: Performance Considerations<br  /></li>
<li><a id="orgheadline122"></a>Chapter 21: Defining Networks<br  /></li>
<li><a id="orgheadline123"></a>Chapter 22: Related Compiler Theory Concepts<br  /></li>
<li><a id="orgheadline124"></a>Chapter 23: Streams and Recursive Function Definitions<br  /></li>
<li><a id="orgheadline125"></a>Chapter 24: Comparison between FBP and Object-Oriented Porgramming<br  /></li>
<li><a id="orgheadline126"></a>Chapter 25: Related Concepts and Forerunners<br  /></li>
<li><a id="orgheadline127"></a>Chapter 26: The FBP Explosion<br  /></li>
<li><a id="orgheadline128"></a>Chapter 27: Ending and Beginnings<br  /></li>
<li><a id="orgheadline129"></a>Appendix: FBP Implementations and Diagramming Tool<br  /></li></ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline142" class="outline-2">
<h2 id="orgheadline142">企業管理</h2>
<div class="outline-text-2" id="text-orgheadline142">
</div><div id="outline-container-orgheadline132" class="outline-3">
<h3 id="orgheadline132">如何建立客服團隊</h3>
<div class="outline-text-3" id="text-orgheadline132">
<ul class="org-ul">
<li>勞力密集</li>
<li>Policy + SOP + System Agreement Management</li>
<li>要能參與重要決策，否則客服不知道如何回答及解決客戶問題。</li>
</ul>
</div>
<div id="outline-container-orgheadline133" class="outline-4">
<h4 id="orgheadline133">常見問題</h4>
<div class="outline-text-4" id="text-orgheadline133">
<ul class="org-ul">
<li>一個流程，各自表述</li>
<li>一個團隊，新人居多</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline134" class="outline-4">
<h4 id="orgheadline134">達成共同目標5大法則</h4>
<div class="outline-text-4" id="text-orgheadline134">
<ul class="org-ul">
<li>尊重人性的關鍵</li>
<li>持續動力的泉源</li>
<li>中午讓團隊成員分享今日的天兵或奧客，宣洩情緒</li>
<li>畫出員工的樂情</li>
<li>允許過程失敗</li>
<li>非常需要肯定與獎賞</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline135" class="outline-4">
<h4 id="orgheadline135">CRM觀念與介紹</h4>
<div class="outline-text-4" id="text-orgheadline135">
<ul class="org-ul">
<li>Marketing</li>
<li>Sales</li>
<li>Oders</li>
<li>Support</li>
<li>行銷自動化</li>
<li>銷售自動化</li>
<li>服務自動化</li>
<li>整合自動化</li>
<li>Excel 也可做CRM</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline136" class="outline-4">
<h4 id="orgheadline136">會員資料</h4>
<div class="outline-text-4" id="text-orgheadline136">
<ul class="org-ul">
<li>分析習慣跟產品的關聯性</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline137" class="outline-4">
<h4 id="orgheadline137">CRM可做什麼?</h4>
<div class="outline-text-4" id="text-orgheadline137">
<ul class="org-ul">
<li>如果能提供滿意快速服務, 舊顧客再高達70%</li>
<li>獲得一位新顧客的成本是舊客戶再度光臨的5-8倍</li>
<li>一個不滿意的顧客會將其不愉快的經驗告訴另外8-10位客戶</li>
<li>每個銷售員的銷售額增加51%</li>
<li>顧客滿意度增加20%</li>
<li>銷售跟服務的成本降低21%</li>
<li>銷售週期少1/3, 利潤增加2%</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline138" class="outline-4">
<h4 id="orgheadline138">客服成本與效益評估</h4>
<div class="outline-text-4" id="text-orgheadline138">
<ul class="org-ul">
<li>平均處理時間(Average Handling Time) - 每人</li>
<li>有效工時8 hour * 0.8</li>
<li>處理案件量*4分鐘/(8小時*60分鐘*0.8) = 96 (日產量)</li>
<li>月薪28000(96*22) = 13.26 (單位成本)</li>
<li>週一到週日: 1.4人力</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline139" class="outline-4">
<h4 id="orgheadline139">團隊可能的角色</h4>
<div class="outline-text-4" id="text-orgheadline139">
<ul class="org-ul">
<li>一線客服</li>
<li>二線客服</li>
<li>教育訓練/QA</li>
<li>主管</li>
<li>(每個一線克服的管理成本約為30%)</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline140" class="outline-4">
<h4 id="orgheadline140">要不要外包?</h4>
<div class="outline-text-4" id="text-orgheadline140">
<ul class="org-ul">
<li>先把SOP建立完畢</li>
<li>30人以上的客服團隊外包才有優勢</li>
<li>一次解決率</li>
<li>客戶滿意度</li>
<li>創造接觸效益</li>
<li>趁客戶打電話來，問最近新功能有沒有用</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline141" class="outline-4">
<h4 id="orgheadline141">客服能達到的效益</h4>
<div class="outline-text-4" id="text-orgheadline141">
<ul class="org-ul">
<li>產品忠誠度</li>
<li>企業形象</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline147" class="outline-2">
<h2 id="orgheadline147">自由軟體/開放源碼</h2>
<div class="outline-text-2" id="text-orgheadline147">
</div><div id="outline-container-orgheadline146" class="outline-3">
<h3 id="orgheadline146">如何成為 Debian Deveoper</h3>
<div class="outline-text-3" id="text-orgheadline146">
</div><div id="outline-container-orgheadline143" class="outline-4">
<h4 id="orgheadline143">10分鐘快速簡介</h4>
<div class="outline-text-4" id="text-orgheadline143">
<ul class="org-ul">
<li>影片: <a href="http://www.youtube.com/watch?v=9ClVlUXi0ZU&amp;feature=player_embedded">成為DD你也行</a></li>
<li>大綱
<ul class="org-ul">
<li>什麼是 Debian Developer</li>
<li>成為 Debian Developer 的好處</li>
<li>成為 Debian Developer 需要很強的技術能力嗎</li>
<li>成為 Debian Developer 有什麼義務</li>
<li>Canonical 目前有幾位 Debian Developer</li>
</ul></li>
</ul>
</div>
</div>
